# Employee Data Exploration

This project explores a dummy employee dataset using **pandas**.  
It demonstrates basic data exploration, filtering, aggregation, and cleaning — 
common steps in a data engineering workflow.

## Dataset
The dataset contains:
- Employee ID
- Name
- Department
- Age
- Salary
- Years at company
- Remote (True/False)

## Employee Data Exploration – Questions

Use **pandas** to answer the following questions about the dataset.

---

### 1. Inspecting the Data
- How many rows and columns are in the dataset?  
- What are the column names and data types?  
- Show the first 5 rows of the dataset.  

---

### 2. Selection & Filtering
- Select only the `name` and `salary` columns.  
- Show all employees in the **IT** department.  
- Find employees who are older than 40.  
- Show employees in **Finance** who also work remotely.  

---

### 3. Aggregations
- What is the **average salary** across the company?  
- What is the **average age per department**?  
- Which department has the **highest total salary**?  
- What is the **maximum years at company**? Who is that employee?  

---

### 4. Data Cleaning / Checks
- Are there any missing values in the dataset?  
- How many employees work **remotely**?  
- What percentage of employees are remote vs in-office?  

---

### 5. Mini Challenges
- Create a new column called `salary_per_year` = `salary / years_at_company`.  
- Sort employees by `salary_per_year` (highest to lowest).  
- Save the sorted results to a new CSV file in the `data/` folder.  

---

✅ *Tip: Think about how each question connects to SQL operations you already know (SELECT, WHERE, GROUP BY, etc.)*

In [165]:
import pandas as pd

In [166]:
import sys

In [167]:
df = pd.read_csv('dummy_employees.csv')

In [168]:
type(df)

pandas.core.frame.DataFrame

In [169]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       20 non-null     int64
 1   name              20 non-null     object
 2   department        20 non-null     object
 3   age               20 non-null     int64
 4   salary            20 non-null     int64
 5   years_at_company  20 non-null     int64
 6   remote            20 non-null     bool
dtypes: bool(1), int64(4), object(2)
memory usage: 1.1+ KB

In [170]:
df.head()

   employee_id        name department  age  salary  years_at_company  remote
0            1  Employee_1         IT   43   44502                 8    True
1            2  Employee_2  Marketing   23   51777                 4   False
2            3  Employee_3         HR   45   40627                 2    True
3            4  Employee_4         IT   51   38792                14   False
4            5  Employee_5         IT   59   73323                 6   False

In [171]:
df[['name','salary']]

           name  salary
0    Employee_1   44502
1    Employee_2   51777
2    Employee_3   40627
3    Employee_4   38792
4    Employee_5   73323
5    Employee_6   73021
6    Employee_7   38433
7    Employee_8   73001
8    Employee_9   41016
9   Employee_10   53897
10  Employee_11   32612
11  Employee_12   53483
12  Employee_13   78555
13  Employee_14   47159
14  Employee_15   74974
15  Employee_16   70994
16  Employee_17   44541
17  Employee_18   65920
18  Employee_19   56531
19  Employee_20   31585

In [172]:
df.loc[df['department'] == 'IT']

    employee_id         name department  age  salary  years_at_company  remote
0             1   Employee_1         IT   43   44502                 8    True
3             4   Employee_4         IT   51   38792                14   False
4             5   Employee_5         IT   59   73323                 6   False
8             9   Employee_9         IT   33   41016                 6   False
10           11  Employee_11         IT   46   32612                 2    True
11           12  Employee_12         IT   48   53483                10   False
12           13  Employee_13         IT   49   78555                12   False
13           14  Employee_14         IT   37   47159                 2    True
19           20  Employee_20         IT   30   31585                14    True

In [173]:
df.loc[df['age'] > 40]

    employee_id         name department  age  salary  years_at_company  remote
0             1   Employee_1         IT   43   44502                 8    True
2             3   Employee_3         HR   45   40627                 2    True
3             4   Employee_4         IT   51   38792                14   False
4             5   Employee_5         IT   59   73323                 6   False
6             7   Employee_7         HR   42   38433                10   False
7             8   Employee_8         HR   54   73001                 4    True
9            10  Employee_10    Finance   43   53897                13    True
10           11  Employee_11         IT   46   32612                 2    True
11           12  Employee_12         IT   48   53483                10   False
12           13  Employee_13         IT   49   78555                12   False
16           17  Employee_17  Marketing   58   44541                 4   False
18           19  Employee_19  Marketing   42   56531                 8    True

In [174]:
df.loc[(df['remote'] == True) & (df['department'] == 'Finance')]

   employee_id         name department  age  salary  years_at_company  remote
9           10  Employee_10    Finance   43   53897                13    True

In [175]:
df['salary'].mean()

np.float64(54237.15)

In [176]:
df.groupby('department')[['age']].agg(['mean'])

              age
             mean
department
Finance     43.00
HR          41.25
IT          44.00
Marketing   35.00

In [177]:
df.groupby('department')[['salary']].sum()

            salary
department
Finance      53897
HR          223055
IT          441027
Marketing   366764

In [178]:
df.groupby('name')[['years_at_company']].max()

             years_at_company
name
Employee_1                  8
Employee_10                13
Employee_11                 2
Employee_12                10
Employee_13                12
Employee_14                 2
Employee_15                10
Employee_16                14
Employee_17                 4
Employee_18                14
Employee_19                 8
Employee_2                  4
Employee_20                14
Employee_3                  2
Employee_4                 14
Employee_5                  6
Employee_6                  6
Employee_7                 10
Employee_8                  4
Employee_9                  6

In [179]:
df[['name', 'age', 'department', 'salary', 'remote', 'years_at_company']]

           name  age department  salary  remote  years_at_company
0    Employee_1   43         IT   44502    True                 8
1    Employee_2   23  Marketing   51777   False                 4
2    Employee_3   45         HR   40627    True                 2
3    Employee_4   51         IT   38792   False                14
4    Employee_5   59         IT   73323   False                 6
5    Employee_6   23  Marketing   73021    True                 6
6    Employee_7   42         HR   38433   False                10
7    Employee_8   54         HR   73001    True                 4
8    Employee_9   33         IT   41016   False                 6
9   Employee_10   43    Finance   53897    True                13
10  Employee_11   46         IT   32612    True                 2
11  Employee_12   48         IT   53483   False                10
12  Employee_13   49         IT   78555   False                12
13  Employee_14   37         IT   47159    True                 2
14  Employee_15   36  Marketing   74974   False                10
15  Employee_16   24         HR   70994   False                14
16  Employee_17   58  Marketing   44541   False                 4
17  Employee_18   28  Marketing   65920    True                14
18  Employee_19   42  Marketing   56531    True                 8
19  Employee_20   30         IT   31585    True                14

In [180]:
df[['remote']].value_counts()

remote
False     10
True      10
Name: count, dtype: int64

In [181]:
df[['remote']].value_counts(normalize=True)

remote
False     0.5
True      0.5
Name: proportion, dtype: float64

In [182]:
df['salary_by_year'] = df['salary'] / df['years_at_company']
df.head(20)

,employee_id,name,department,age,salary,years_at_company,remote,salary_by_year
0,1,Employee_1,IT,43,44502,8,True,5562.750000
1,2,Employee_2,Marketing,23,51777,4,False,12944.250000
2,3,Employee_3,HR,45,40627,2,True,20313.500000
3,4,Employee_4,IT,51,38792,14,False,2770.857143
4,5,Employee_5,IT,59,73323,6,False,12220.500000
5,6,Employee_6,Marketing,23,73021,6,True,12170.166667
6,7,Employee_7,HR,42,38433,10,False,3843.300000
7,8,Employee_8,HR,54,73001,4,True,18250.250000
8,9,Employee_9,IT,33,41016,6,False,6836.000000
9,10,Employee_10,Finance,43,53897,13,True,4145.923077
10,11,Employee_11,IT,46,32612,2,True,16306.000000
11,12,Employee_12,IT,48,53483,10,False,5348.300000
12,13,Employee_13,IT,49,78555,12,False,6546.250000
13,14,Employee_14,IT,37,47159,2,True,23579.500000
14,15,Employee_15,Marketing,36,74974,10,False,7497.400000
15,16,Employee_16,HR,24,70994,14,False,5071.000000
16,17,Employee_17,Marketing,58,44541,4,False,11135.250000
17,18,Employee_18,Marketing,28,65920,14,True,4708.571429
18,19,Employee_19,Marketing,42,56531,8,True,7066.375000
19,20,Employee_20,IT,30,31585,14,True,2256.071429

In [31]:
df_salary_sort = df.sort_values('salary_by_year', ascending=False)
df_salary_sort

,employee_id,name,department,age,salary,years_at_company,remote,salary_by_year
13,14,Employee_14,IT,37,47159,2,True,23579.500000
2,3,Employee_3,HR,45,40627,2,True,20313.500000
7,8,Employee_8,HR,54,73001,4,True,18250.250000
10,11,Employee_11,IT,46,32612,2,True,16306.000000
1,2,Employee_2,Marketing,23,51777,4,False,12944.250000
4,5,Employee_5,IT,59,73323,6,False,12220.500000
5,6,Employee_6,Marketing,23,73021,6,True,12170.166667
16,17,Employee_17,Marketing,58,44541,4,False,11135.250000
14,15,Employee_15,Marketing,36,74974,10,False,7497.400000
18,19,Employee_19,Marketing,42,56531,8,True,7066.375000
8,9,Employee_9,IT,33,41016,6,False,6836.000000
12,13,Employee_13,IT,49,78555,12,False,6546.250000
0,1,Employee_1,IT,43,44502,8,True,5562.750000
11,12,Employee_12,IT,48,53483,10,False,5348.300000
15,16,Employee_16,HR,24,70994,14,False,5071.000000
17,18,Employee_18,Marketing,28,65920,14,True,4708.571429
9,10,Employee_10,Finance,43,53897,13,True,4145.923077
6,7,Employee_7,HR,42,38433,10,False,3843.300000
3,4,Employee_4,IT,51,38792,14,False,2770.857143
19,20,Employee_20,IT,30,31585,14,True,2256.071429

In [32]:
df_salary_sort.to_csv('data/salary_sort.csv')